app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.build(post_params)

    if @post.save
---
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "wow"], ["content", "lets go"], ["user_id", 1], ["created_at", "2021-10-24 00:58:11.326646"], ["updated_at", "2021-10-24 00:58:11.326646"]]