app/controllers/posts_controller.rb

  def allposts
    @posts = Post.all
---
SELECT "posts".* FROM "posts"